src/src/DocumentJournals/CashFlowForecastDocuments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DocumentJournal>
		<Properties>
			<Name>CashFlowForecastDocuments</Name>
			<RegisteredDocuments>
				<xr:Item>Document.CashInflowForecast</xr:Item>
				<xr:Item>Document.ExpenditureRequest</xr:Item>
				<xr:Item>Document.CashTransferPlan</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Company</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.Company</xr:Item>
						<xr:Item>Document.CashInflowForecast.Attribute.Company</xr:Item>
						<xr:Item>Document.ExpenditureRequest.Attribute.Company</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>CashAssetsType</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.CashAssetsType</xr:Item>
						<xr:Item>Document.CashInflowForecast.Attribute.CashAssetsType</xr:Item>
						<xr:Item>Document.ExpenditureRequest.Attribute.CashAssetsType</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>PettyCash</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.PettyCash</xr:Item>
						<xr:Item>Document.CashInflowForecast.Attribute.PettyCash</xr:Item>
						<xr:Item>Document.ExpenditureRequest.Attribute.PettyCash</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Item</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.CashFlowItem</xr:Item>
						<xr:Item>Document.CashInflowForecast.Attribute.CashFlowItem</xr:Item>
						<xr:Item>Document.ExpenditureRequest.Attribute.CashFlowItem</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Counterparty</Name>
					<References>
						<xr:Item>Document.CashInflowForecast.Attribute.Counterparty</xr:Item>
						<xr:Item>Document.ExpenditureRequest.Attribute.Counterparty</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>AmountReceipt</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.DocumentAmount</xr:Item>
						<xr:Item>Document.CashInflowForecast.Attribute.DocumentAmount</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>AmountExpense</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.DocumentAmount</xr:Item>
						<xr:Item>Document.ExpenditureRequest.Attribute.DocumentAmount</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Currency</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.DocumentCurrency</xr:Item>
						<xr:Item>Document.CashInflowForecast.Attribute.DocumentCurrency</xr:Item>
						<xr:Item>Document.ExpenditureRequest.Attribute.DocumentCurrency</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Comment</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.Comment</xr:Item>
						<xr:Item>Document.CashInflowForecast.Attribute.Comment</xr:Item>
						<xr:Item>Document.ExpenditureRequest.Attribute.Comment</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Author</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.Author</xr:Item>
						<xr:Item>Document.CashInflowForecast.Attribute.Author</xr:Item>
						<xr:Item>Document.ExpenditureRequest.Attribute.Author</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>BankAccount</Name>
					<References>
						<xr:Item>Document.CashTransferPlan.Attribute.BankAccount</xr:Item>
						<xr:Item>Document.CashInflowForecast.Attribute.BankAccount</xr:Item>
						<xr:Item>Document.ExpenditureRequest.Attribute.BankAccount</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/src/DocumentJournals/CashFlowForecastDocuments/Forms/ListForm/Ext/Form/Module.bsl
#Region EventHandlers

// Procedure - form event handler "OnLoadDataFromSettingsAtServer".
//
&AtServer
Procedure OnLoadDataFromSettingsAtServer(Settings)
	
	Company				  = Settings.Get("Company");
	Counterparty				  = Settings.Get("Counterparty");
	BankAccountPettyCash		  = Settings.Get("BankAccountPettyCash");
	
	DriveClientServer.SetListFilterItem(List, "Company", Company, ValueIsFilled(Company));
		DriveClientServer.SetListFilterItem(List, "Counterparty", Counterparty, ValueIsFilled(Counterparty));
	If TypeOf(BankAccountPettyCash) = Type("CatalogRef.CashAccounts") Then
		DriveClientServer.SetListFilterItem(List, "PettyCash", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
	ElsIf TypeOf(BankAccountPettyCash) = Type("CatalogRef.BankAccounts") Then
		DriveClientServer.SetListFilterItem(List, "BankAccount", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
	Else
		DriveClientServer.SetListFilterItem(List, "PettyCash", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
		DriveClientServer.SetListFilterItem(List, "BankAccount", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
	EndIf;
	
EndProcedure

// Procedure - event handler OnChange of attribute BankAccountPettyCash.
//
&AtClient
Procedure BankAccountPettyCashOnChange(Item)
	
	If TypeOf(BankAccountPettyCash) = Type("CatalogRef.CashAccounts") Then
		DriveClientServer.SetListFilterItem(List, "PettyCash", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
	ElsIf TypeOf(BankAccountPettyCash) = Type("CatalogRef.BankAccounts") Then
		DriveClientServer.SetListFilterItem(List, "BankAccount", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
	Else
		DriveClientServer.SetListFilterItem(List, "PettyCash", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
		DriveClientServer.SetListFilterItem(List, "BankAccount", BankAccountPettyCash, ValueIsFilled(BankAccountPettyCash));
	EndIf;
	
EndProcedure

// Procedure - event handler OnChange of attribute Counterparty.
//
&AtClient
Procedure CounterpartyOnChange(Item)
	
	DriveClientServer.SetListFilterItem(List, "Counterparty", Counterparty, ValueIsFilled(Counterparty));
	
EndProcedure

// Procedure - event handler OnChange of the Company attribute.
//
&AtClient
Procedure CompanyOnChange(Item)
	
	DriveClientServer.SetListFilterItem(List, "Company", Company, ValueIsFilled(Company));
	
EndProcedure

&AtClient
Procedure ListOnActivateRow(Item)
	
	CurrentRow = Items.List.CurrentData;
	If CurrentRow <> Undefined Then
		Items.Information.Title = Format(CurrentRow.Date, "DLF=D");
	EndIf;
	
EndProcedure

#EndRegion
